-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Авг 02 2023 г., 05:36
-- Версия сервера: 8.0.32
-- Версия PHP: 8.1.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `pencilsoft_expenses`
--

-- --------------------------------------------------------

--
-- Структура таблицы `expenses`
--

CREATE TABLE `expenses` (
  `id` int NOT NULL,
  `date` date NOT NULL,
  `sum` decimal(10,2) NOT NULL,
  `comment` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `expenses`
--

INSERT INTO `expenses` (`id`, `date`, `sum`, `comment`) VALUES
(1, '2023-07-01', 65.00, 'Покупка обуви'),
(2, '2023-07-02', 20.50, 'Завтрак в кафе'),
(3, '2023-07-03', 15.75, 'Проездной билет на неделю'),
(4, '2023-07-04', 50.00, 'Подписка на стриминговый сервис'),
(5, '2023-07-05', 90.25, 'Ужин в ресторане'),
(6, '2023-07-06', 25.00, 'Покупка подарков'),
(7, '2023-07-06', 40.00, 'Такси домой'),
(8, '2023-07-07', 15.50, 'Кофе на рабочем перерыве'),
(9, '2023-07-08', 75.20, 'Покупка бытовой техники'),
(10, '2023-07-09', 55.00, 'Купил новую игру'),
(11, '2023-07-10', 30.00, 'Книга по программированию'),
(12, '2023-07-10', 22.75, 'Обед семьей в ресторане'),
(13, '2023-07-11', 18.30, 'Концертный билет'),
(14, '2023-07-12', 40.25, 'Такси на вокзал'),
(15, '2023-07-13', 90.00, 'Покупка подарков на праздник'),
(16, '2023-07-14', 65.50, 'Покупка канцелярских товаров'),
(17, '2023-07-15', 25.75, 'Завтрак в поезде'),
(18, '2023-07-16', 70.20, 'Обед с коллегами'),
(19, '2023-07-17', 15.00, 'Покупка фильма в цифровом виде'),
(20, '2023-07-18', 50.30, 'Покупка музыкального альбома'),
(21, '2023-07-19', 35.25, 'Покупка спортивных товаров'),
(22, '2023-07-20', 120.50, 'Театральный билет'),
(23, '2023-07-21', 80.00, 'Покупка игрушек для детей'),
(24, '2023-07-22', 100.00, 'Покупка продуктов на неделю'),
(25, '2023-07-23', 25.50, 'Покупка мобильного приложения'),
(26, '2023-07-24', 19.75, 'Кофе с друзьями'),
(27, '2023-07-25', 75.00, 'Оплата интернет-сервиса'),
(28, '2023-07-26', 50.25, 'Купил себе подарок'),
(29, '2023-07-27', 30.50, 'Такси до работы'),
(30, '2023-07-28', 15.75, 'Обед в кафе'),
(31, '2023-07-29', 100.00, 'Оплата счетов'),
(32, '2023-07-30', 20.00, 'Кофе с коллегами'),
(33, '2023-07-31', 45.75, 'Купил новую книгу'),
(34, '2023-07-31', 70.20, 'Покупка одежды'),
(35, '2023-07-31', 25.00, 'Кино с друзьями'),
(36, '2023-07-30', 15.50, 'Обед в столовой'),
(37, '2023-07-29', 50.00, 'Такси до аэропорта'),
(38, '2023-07-28', 120.00, 'Подарок на день рождения друга'),
(39, '2023-07-27', 80.30, 'Технические принадлежности'),
(40, '2023-07-26', 35.25, 'Закуски и напитки на вечеринке'),
(41, '2023-07-25', 65.00, 'Покупка обуви'),
(42, '2023-07-24', 20.50, 'Завтрак в кафе'),
(43, '2023-07-23', 15.75, 'Проездной билет на неделю'),
(44, '2023-07-22', 50.00, 'Подписка на стриминговый сервис'),
(45, '2023-07-21', 90.25, 'Ужин в ресторане'),
(46, '2023-07-20', 25.00, 'Покупка подарков'),
(47, '2023-07-19', 40.00, 'Такси домой'),
(48, '2023-07-18', 15.50, 'Кофе на рабочем перерыве'),
(49, '2023-07-17', 75.20, 'Покупка бытовой техники');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `expenses`
--
ALTER TABLE `expenses`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `expenses`
--
ALTER TABLE `expenses`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
